/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Parametro non valido.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Codice operazione non valido.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Connessione al server non riuscita. Controlla i dati di login.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "Reset dell'app non riuscito. Verifica la connessione alla rete.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "Utente già connesso.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "Operazione già in esecuzione.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Contesto operazione non valido.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "ID non valido per protocollo di comunicazione.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "ID elemento azione non valido.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Impossibile determinare il protocollo di comunicazione.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Impossibile chiamare la chiave per il certificato.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Impossibile chiamare il certificato.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Errore sconosciuto.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "L'archiviazione sicura esiste già.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "Errore nel tipo di dati";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "L'archiviazione sicura non esiste.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Argomento non valido";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Inserisci il codice di accesso corretto.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Controlla la tua password.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "Archiviazione sicura bloccata";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Memoria insufficiente per l'archiviazione sicura";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "Codice di accesso scaduto; è necessario modificarlo.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Inserisci un codice di accesso con almeno {0} caratteri univoci.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Inserisci un codice di accesso con almeno una cifra.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Inserisci un codice di accesso con almeno un carattere minuscolo.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Inserisci un codice di accesso con almeno un carattere speciale.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "Questo dispositivo è già registrato con un utente diverso.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Inserisci un codice di accesso con almeno un carattere maiuscolo.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Inserisci un codice di accesso con almeno {0} caratteri.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Inserisci un codice di accesso con almeno {0} caratteri univoci.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "I codici di accesso inseriti non corrispondono.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "L'operazione non è consentita in questo stato.";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "I dati di login inseriti non sono sufficienti o validi; riprova.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Connessione al server non riuscita. Controlla i dati di login.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Controlla nome utente e password.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Connessione al server non riuscita. Contatta l'amministratore.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "I dati di login inseriti non sono sufficienti o validi; riprova.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Inserisci il codice di accesso corretto.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Inserisci un codice di accesso con almeno una cifra.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "I codici di accesso inseriti non corrispondono.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "Codice di accesso scaduto; è necessario modificarlo.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Inserisci un codice di accesso con almeno {0} caratteri.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Inserisci un codice di accesso con almeno una lettera minuscola.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Inserisci un codice di accesso con almeno un carattere speciale.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Inserisci un codice di accesso con almeno {0} caratteri univoci.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Inserisci un codice di accesso con almeno una lettera maiuscola.";

/* XMSG max. 100 chars */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "L'archiviazione sicura è stata eliminata.";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "Operazione non supportata";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Codice di accesso SSO non valido.";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Credenziali Afaria non valide.";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "Client Identity not found";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "Access is denied";

